## Plan Result (prod_apim_appgw)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw"
    }

  # module.app-gw.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw"
        name                              = "cft-apim00-prod-agw"
        tags                              = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      ~ ssl_profile {
            id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-commissioning-sslprofile"
            name                                 = "civil-sdt-commissioning-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "civil-sdt-commissioning-trusted-cert" -> "civil-sdt-commissioning-civil_sdt_root_ca",
            ]
            # (2 unchanged attributes hidden)
        }
      ~ ssl_profile {
            id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-sslprofile"
            name                                 = "civil-sdt-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "civil-sdt-trusted-cert" -> "civil-sdt-civil_sdt_root_ca",
            ]
            # (2 unchanged attributes hidden)
        }
      ~ ssl_profile {
            id                                   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/sslProfiles/civil-sdt-test-sslprofile"
            name                                 = "civil-sdt-test-sslprofile"
          ~ trusted_client_certificate_names     = [
              ~ "civil-sdt-test-trusted-cert" -> "civil-sdt-test-civil_sdt_root_ca",
            ]
            # (2 unchanged attributes hidden)
        }

      ~ trusted_client_certificate {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-commissioning-trusted-cert"
          ~ name = "civil-sdt-commissioning-trusted-cert" -> "civil-sdt-commissioning-civil_sdt_root_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-trusted-cert"
          ~ name = "civil-sdt-trusted-cert" -> "civil-sdt-civil_sdt_root_ca"
            # (1 unchanged attribute hidden)
        }
      ~ trusted_client_certificate {
            id   = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw/trustedClientCertificates/civil-sdt-test-trusted-cert"
          ~ name = "civil-sdt-test-trusted-cert" -> "civil-sdt-test-civil_sdt_root_ca"
            # (1 unchanged attribute hidden)
        }

        # (30 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                             = "/subscriptions/0978315c-75fe-4ada-9d11-1eb5e0e0b214/resourceGroups/hmcts-hub-prod-int/providers/Microsoft.Network/applicationGateways/cft-apim00-prod-agw|AppGw"
        name                           = "AppGw"
        # (5 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2164,"Program":"tfcmt","SHA1":"","Target":"prod_apim_appgw","Vars":{}} -->